src/DataProcessors/ДопроведениеРезервов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ДопроведениеРезервов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтрокаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегламентныеЗадания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДобавленоРезервов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Регистратор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаЗаявки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/AccumulationRegisters/ЗаявкиПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаявкиПокупателей</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Отказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/РезервыТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>РезервыТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПрихода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокПриходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ТипПоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипПоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Кросс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VMI</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийПеремещенияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПеремещенияТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СвободноеПеремещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаТопЛог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаТопЛог</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПеремещениеТоваров</Name>
			<Comment>(Общ)</Comment>
			<BasedOn>
				<xr:Item>Document.ВнутреннийЗаказ</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПартииТоваровVMI</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровВПути</xr:Item>
				<xr:Item>AccumulationRegister.ЗаявкиПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ОтказыПоЗаявкам</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКРезервированию</xr:Item>
				<xr:Item>AccumulationRegister.ПополнениеСклада</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВПути</xr:Item>
				<xr:Item>AccumulationRegister.РезервыТоваров</xr:Item>
				<xr:Item>InformationRegister.ИсторияЗаявокПокупателя</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПеремещенияТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФилиалОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФилиалПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>если реквизит заполнен - значит идет приемка из ТопЛог</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмещениеСсылкаТопЛог</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгруженВТопЛог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновленИзТопЛог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИзТопЛог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданВ77</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флНеВыгружатьВТопЛог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АктРассмотренияВозврата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктРассмотренияВозврата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поступление</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНеПринято</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Качество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Качество</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПрихода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокПриходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаЗаявки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПлан</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/ДопроведениеРезервов/Ext/ObjectModule.bsl
Процедура ВыполнитьРегламентноеЗадание() Экспорт 
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ПеремещениеТоваровТовары.Ссылка,
	//               |	ПеремещениеТоваровТовары.СтрокаЗаявки,
	//               |	СУММА(ПеремещениеТоваровТовары.Количество) КАК Количество
	//               |ПОМЕСТИТЬ втТовары
	//               |ИЗ
	//               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	//               |ГДЕ
	//               |	ПеремещениеТоваровТовары.Ссылка.Дата >= &Дата
	//               |	И ПеремещениеТоваровТовары.Ссылка.Проведен
	//               |	И ПеремещениеТоваровТовары.Ссылка.СтатусДокумента = &СтатусДокумента
	//               |	И ПеремещениеТоваровТовары.СтрокаЗаявки <> &ПустаяСтрокаЗаявки
	//               |	И ПеремещениеТоваровТовары.Количество > 0
	//               |	И НЕ ПеремещениеТоваровТовары.СтрокаЗаявки.ТипПоставки = ЗНАЧЕНИЕ(Перечисление.ТипПоставки.ПополнениеСклада)
	//               |	И НЕ ПеремещениеТоваровТовары.СтрокаЗаявки.Виртуальная
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	ПеремещениеТоваровТовары.Ссылка,
	//               |	ПеремещениеТоваровТовары.СтрокаЗаявки
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	втТовары.Ссылка,
	//               |	втТовары.СтрокаЗаявки,
	//               |	ВЫБОР
	//               |		КОГДА ЗаявкиПокупателейОстаткиИОбороты.КоличествоНачальныйОстаток < втТовары.Количество
	//               |			ТОГДА ЗаявкиПокупателейОстаткиИОбороты.КоличествоНачальныйОстаток
	//               |		ИНАЧЕ втТовары.Количество
	//               |	КОНЕЦ КАК Количество
	//               |ПОМЕСТИТЬ втТовары2
	//               |ИЗ
	//               |	РегистрНакопления.ЗаявкиПокупателей.ОстаткиИОбороты(
	//               |			,
	//               |			,
	//               |			Регистратор,
	//               |			,
	//               |			СтрокаЗаявки В
	//               |				(ВЫБРАТЬ
	//               |					втТовары.СтрокаЗаявки
	//               |				ИЗ
	//               |					втТовары)) КАК ЗаявкиПокупателейОстаткиИОбороты
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТовары КАК втТовары
	//               |		ПО ЗаявкиПокупателейОстаткиИОбороты.Регистратор = втТовары.Ссылка
	//               |			И ЗаявкиПокупателейОстаткиИОбороты.СтрокаЗаявки = втТовары.СтрокаЗаявки
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	втТовары2.Ссылка,
	//               |	втТовары2.СтрокаЗаявки,
	//               |	втТовары2.Количество,
	//               |	ЕСТЬNULL(РезервыТоваровОбороты.КоличествоПриход, 0) КАК ВсталоВРезерв
	//               |ИЗ
	//               |	втТовары2 КАК втТовары2
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТоваров.Обороты(
	//               |				,
	//               |				,
	//               |				Регистратор,
	//               |				СтрокаЗаявки В
	//               |					(ВЫБРАТЬ
	//               |						втТовары2.СтрокаЗаявки
	//               |					ИЗ
	//               |						втТовары2)) КАК РезервыТоваровОбороты
	//               |		ПО втТовары2.Ссылка = РезервыТоваровОбороты.Регистратор
	//               |			И втТовары2.СтрокаЗаявки = РезервыТоваровОбороты.СтрокаЗаявки
	//               |ГДЕ
	//               |	втТовары2.Количество > ЕСТЬNULL(РезервыТоваровОбороты.КоличествоПриход, 0)"
				   
				   
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкиПокупателейОстатки.СтрокаЗаявки,
	               |	ЗаявкиПокупателейОстатки.КоличествоОстаток
	               |ПОМЕСТИТЬ втЗаявки
	               |ИЗ
	               |	РегистрНакопления.ЗаявкиПокупателей.Остатки(
	               |			,
	               |			СтрокаЗаявки.ТипПоставки = &ТипПоставки
	               |				И (СтрокаЗаявки = &СтрокаЗаявки
	               |					ИЛИ &ВсеСтрокиЗаявок)) КАК ЗаявкиПокупателейОстатки
	               |ГДЕ
	               |	ЗаявкиПокупателейОстатки.КоличествоОстаток > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РезервыТоваровОстатки.СтрокаЗаявки,
	               |	РезервыТоваровОстатки.КоличествоОстаток
	               |ПОМЕСТИТЬ втРезервы
	               |ИЗ
	               |	РегистрНакопления.РезервыТоваров.Остатки(
	               |			,
	               |			СтрокаЗаявки В
	               |				(ВЫБРАТЬ
	               |					втЗаявки.СтрокаЗаявки
	               |				ИЗ
	               |					втЗаявки)) КАК РезервыТоваровОстатки
	               |ГДЕ
	               |	РезервыТоваровОстатки.КоличествоОстаток > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	вт.СтрокаЗаявки,
	               |	вт.КоличествоОстаток - ЕСТЬNULL(втРезервы.КоличествоОстаток, 0) КАК КоличествоОстаток
	               |ПОМЕСТИТЬ втЗаявкиМинусРезервы
	               |ИЗ
	               |	втЗаявки КАК вт
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втРезервы КАК втРезервы
	               |		ПО вт.СтрокаЗаявки = втРезервы.СтрокаЗаявки
	               |ГДЕ
	               |	вт.КоличествоОстаток - ЕСТЬNULL(втРезервы.КоличествоОстаток, 0) > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПеремещениеТоваровТовары.Ссылка,
	               |	ПеремещениеТоваровТовары.Ссылка.Дата,
	               |	СУММА(ПеремещениеТоваровТовары.Количество) КАК Количество,
	               |	ПеремещениеТоваровТовары.СтрокаЗаявки,
	               |	втЗаявкиМинусРезервы.КоличествоОстаток,
	               |	ПеремещениеТоваровТовары.Номенклатура,
	               |	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель
	               |ПОМЕСТИТЬ вт2
	               |ИЗ
	               |	втЗаявкиМинусРезервы КАК втЗаявкиМинусРезервы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |		ПО втЗаявкиМинусРезервы.СтрокаЗаявки = ПеремещениеТоваровТовары.СтрокаЗаявки
	               |ГДЕ
	               |	ПеремещениеТоваровТовары.Ссылка.Проведен
	               |	И ПеремещениеТоваровТовары.Ссылка.СтатусДокумента = &СтатусДокумента
	               |	И ПеремещениеТоваровТовары.Ссылка.ВидОперации = &ВидОперации
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПеремещениеТоваровТовары.Ссылка.Дата,
	               |	ПеремещениеТоваровТовары.СтрокаЗаявки,
	               |	втЗаявкиМинусРезервы.КоличествоОстаток,
	               |	ПеремещениеТоваровТовары.Ссылка,
	               |	ПеремещениеТоваровТовары.Номенклатура,
	               |	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	вт2.Ссылка КАК Ссылка,
	               |	вт2.Дата КАК Дата,
	               |	вт2.Количество,
	               |	вт2.СтрокаЗаявки КАК СтрокаЗаявки,
	               |	вт2.КоличествоОстаток КАК КоличествоОстаток,
	               |	ЕСТЬNULL(РезервыТоваровОбороты.КоличествоПриход, 0) КАК КоличествоРезерв,
	               |	вт2.Количество - ЕСТЬNULL(РезервыТоваровОбороты.КоличествоПриход, 0) КАК МожноДобавитьРезерв,
	               |	вт2.Номенклатура,
	               |	вт2.СкладПолучатель КАК СкладПолучатель
	               |ИЗ
	               |	вт2 КАК вт2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТоваров.Обороты(, , Регистратор, ) КАК РезервыТоваровОбороты
	               |		ПО вт2.Ссылка = РезервыТоваровОбороты.Регистратор
	               |			И вт2.СтрокаЗаявки = РезервыТоваровОбороты.СтрокаЗаявки
	               |			И вт2.Номенклатура = РезервыТоваровОбороты.Номенклатура
	               |ГДЕ
	               |	вт2.Количество > ЕСТЬNULL(РезервыТоваровОбороты.КоличествоПриход, 0)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ
	               |ИТОГИ
	               |	МАКСИМУМ(Дата),
	               |	МАКСИМУМ(КоличествоОстаток),
	               |	МАКСИМУМ(СкладПолучатель)
	               |ПО
	               |	СтрокаЗаявки,
	               |	Ссылка";
	Запрос.УстановитьПараметр("ТипПоставки", Перечисления.ТипПоставки.Кросс);
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийПеремещенияТоваров.ПриемкаТопЛог);
	Запрос.УстановитьПараметр("СтатусДокумента", Справочники.СтатусыДокументов.ПеремещениеТоваровПоступил);
	Запрос.УстановитьПараметр("СтрокаЗаявки", СтрокаЗаявки);
	Запрос.УстановитьПараметр("ВсеСтрокиЗаявок", Не ЗначениеЗаполнено(СтрокаЗаявки));
	НачатьТранзакцию();
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СтрокаЗаявки");
	ЗафиксироватьТранзакцию();
	
	Пока Выборка.Следующий() Цикл 
		ВыборкаПоДокументам = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
		КоличествоОстаток = Выборка.КоличествоОстаток;
		Пока ВыборкаПоДокументам.Следующий() Цикл 
			ВыборкаПоТоварам = ВыборкаПоДокументам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			ТаблицаДвижений = Новый ТаблицаЗначений;
			ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("РезервыТоваров", ТаблицаДвижений);
			
			Пока ВыборкаПоТоварам.Следующий() Цикл 
				ДобавляемыйРезерв = Мин(КоличествоОстаток, 	ВыборкаПоТоварам.МожноДобавитьРезерв);
				Если ДобавляемыйРезерв > 0 Тогда 
					НоваяСтрока = ТаблицаДвижений.Добавить();	
					НоваяСтрока.Период = ВыборкаПоДокументам.Дата;
					НоваяСтрока.Регистратор = ВыборкаПоДокументам.Ссылка;
					НоваяСтрока.Номенклатура = ВыборкаПоТоварам.Номенклатура;
					НоваяСтрока.Склад = ВыборкаПоДокументам.СкладПолучатель;
					НоваяСтрока.Качество = Справочники.Качество.Новый;
					НоваяСтрока.СтрокаЗаявки = ВыборкаПоТоварам.СтрокаЗаявки;
					
					НоваяСтрока.Количество =  ДобавляемыйРезерв;
					НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
				КонецЕсли;
				КоличествоОстаток = КоличествоОстаток - ДобавляемыйРезерв;
				
			КонецЦикла;
			Если ТаблицаДвижений.Количество() > 0 Тогда 	
				ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаДвижений, ДобавленоРезервов);
				Результат = ПроведениеДокументовКлиентСервер.ЗначенияДвиженийДокумента(ВыборкаПоДокументам.Ссылка,
										Метаданные.РегистрыНакопления.РезервыТоваров);
				ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаДвижений, Результат);
				
				Набор = РегистрыНакопления.РезервыТоваров.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(ВыборкаПоДокументам.Ссылка);
				Набор.Загрузить(Результат);
				Набор.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Строка = "";
	СформироватьТелоСообщения(Строка);
	#Если Сервер Тогда 
		ДобавитьВКритСобытия(Строка);
	#КонецЕсли
КонецПроцедуры

Процедура СформироватьТелоСообщения(Строка)
	Если ДобавленоРезервов.Количество() > 0 Тогда 
		Текст = Новый ТекстовыйДокумент;
		Стр = "Номер перемещения; Дата перемещения; Номенклатура; Уид номенклатуры; IDSite; Количество";
		Текст.ДобавитьСтроку(Стр);
		Для Каждого СтрокаТЧ Из ДобавленоРезервов Цикл
			Стр = "" + СтрокаТЧ.Регистратор.Номер + ";"  + СтрокаТЧ.Регистратор.Дата + ";" + СтрокаТЧ.Номенклатура.Наименование + ";" + СтрокаТЧ.Номенклатура.УникальныйИдентификатор() + ";" + СтрокаТЧ.СтрокаЗаявки.IDSite + ";" + СтрокатЧ.Количество;
			Текст.ДобавитьСтроку(Стр);
		КонецЦикла;
		Строка = Текст.ПолучитьТекст();
	КонецЕсли;	
КонецПроцедуры

Процедура ДобавитьВКритСобытия(Строка)
	Если Не ПустаяСтрока(Строка) Тогда 
		МестоВозникновения = "Обработка." + ЭтотОбъект.Метаданные().Имя + ".МодульОбъекта.ВыполнитьРегламентноеЗадание";
		
		КритическиеСобытияСервер.ЗарегистрироватьКритическоеСобытие(
		РегламентноеЗадание, 
		Справочники.СобытияДляОтправкиЭлектронныхПисем.ДопроведениеРезервов,
		Строка,
		,
		Истина,
		Строка, 
		МестоВозникновения
		);
	КонецЕсли;
КонецПроцедуры
